BitNibble/Source_Library/stm32f411lib/Library/Src/stm32411rcc.c
/******************************************************************************
	STM32 F411 RCC
Author: Sergio Santos 
	<sergio.salazar.santos@gmail.com>
License: GNU General Public License
Hardware: STM32-F411
Date: 19062023
Comment:
	
*******************************************************************************/
/*** File Library ***/
#include <stm32411rcc.h>

/*** File Variables ***/
static STM32FXXXRCC_cr stm32fxxx_rcc_cr;
static STM32FXXXRCC_pllcfgr stm32fxxx_rcc_pllcfgr;
static STM32FXXXRCC_cfgr stm32fxxx_rcc_cfgr;
static STM32FXXXRCC_cir stm32fxxx_rcc_cir;
static STM32FXXXRCC_ahb1rstr stm32fxxx_rcc_ahb1rstr;
static STM32FXXXRCC_ahb2rstr stm32fxxx_rcc_ahb2rstr;
static STM32FXXXRCC_apb1rstr stm32fxxx_rcc_apb1rstr;
static STM32FXXXRCC_apb2rstr stm32fxxx_rcc_apb2rstr;
static STM32FXXXRCC_ahb1enr stm32fxxx_rcc_ahb1enr;
static STM32FXXXRCC_ahb2enr stm32fxxx_rcc_ahb2enr;
static STM32FXXXRCC_apb1enr stm32fxxx_rcc_apb1enr;
static STM32FXXXRCC_apb2enr stm32fxxx_rcc_apb2enr;
static STM32FXXXRCC_ahb1lpenr stm32fxxx_rcc_ahb1lpenr;
static STM32FXXXRCC_ahb2lpenr stm32fxxx_rcc_ahb2lpenr;
static STM32FXXXRCC_apb1lpenr stm32fxxx_rcc_apb1lpenr;
static STM32FXXXRCC_apb2lpenr stm32fxxx_rcc_apb2lpenr;
static STM32FXXXRCC_bdcr stm32fxxx_rcc_bdcr;
static STM32FXXXRCC_csr stm32fxxx_rcc_csr;
static STM32FXXXRCC_sscgr stm32fxxx_rcc_sscgr;
static STM32FXXXRCC_plli2scfgr stm32fxxx_rcc_plli2scfgr;
static STM32FXXXRCC_dckcfgr stm32fxxx_rcc_dckcfgr;
static STM32FXXXRCCPLL stm32fxxx_rcc_pll;
static STM32FXXXRCCPLLI2S stm32fxxx_rcc_plli2s;
static STM32FXXXRCCPLLSAI stm32fxxx_rcc_pllsai;
static STM32FXXXRCCobj stm32fxxx_rcc;

/*** File Procedure & Function Header ***/
STM32FXXXRCC_cr* stm32fxxx_rcc_cr_inic(void);
STM32FXXXRCC_pllcfgr* stm32fxxx_rcc_pllcfgr_inic(void);
STM32FXXXRCC_cfgr* stm32fxxx_rcc_cfgr_inic(void);
STM32FXXXRCC_cir* stm32fxxx_rcc_cir_inic(void);
STM32FXXXRCC_ahb1rstr* stm32fxxx_rcc_ahb1rstr_inic(void);
STM32FXXXRCC_ahb2rstr* stm32fxxx_rcc_ahb2rstr_inic(void);
STM32FXXXRCC_ahb3rstr* stm32fxxx_rcc_ahb3rstr_inic(void);
STM32FXXXRCC_apb1rstr* stm32fxxx_rcc_apb1rstr_inic(void);
STM32FXXXRCC_apb2rstr* stm32fxxx_rcc_apb2rstr_inic(void);
STM32FXXXRCC_ahb1enr* stm32fxxx_rcc_ahb1enr_inic(void);
STM32FXXXRCC_ahb2enr* stm32fxxx_rcc_ahb2enr_inic(void);
STM32FXXXRCC_apb1enr* stm32fxxx_rcc_apb1enr_inic(void);
STM32FXXXRCC_apb2enr* stm32fxxx_rcc_apb2enr_inic(void);
STM32FXXXRCC_ahb1lpenr* stm32fxxx_rcc_ahb1lpenr_inic(void);
STM32FXXXRCC_ahb2lpenr* stm32fxxx_rcc_ahb2lpenr_inic(void);
STM32FXXXRCC_ahb3lpenr* stm32fxxx_rcc_ahb3lpenr_inic(void);
STM32FXXXRCC_apb1lpenr* stm32fxxx_rcc_apb1lpenr_inic(void);
STM32FXXXRCC_apb2lpenr* stm32fxxx_rcc_apb2lpenr_inic(void);
STM32FXXXRCC_bdcr* stm32fxxx_rcc_bdcr_inic(void);
STM32FXXXRCC_csr* stm32fxxx_rcc_csr_inic(void);
STM32FXXXRCC_sscgr* stm32fxxx_rcc_sscgr_inic(void);
STM32FXXXRCC_plli2scfgr* stm32fxxx_rcc_plli2scfgr_inic(void);
STM32FXXXRCC_dckcfgr* stm32fxxx_rcc_dckcfgr_inic(void);
/*** Extended ***/
STM32FXXXRCCPLL* stm32fxxx_rcc_pll_inic(void);
STM32FXXXRCCPLLI2S* stm32fxxx_rcc_plli2s_inic(void);
STM32FXXXRCCPLLSAI* stm32fxxx_rcc_pllsai_inic(void);
/******/
void STM32FXXXRccPwrClock(uint8_t bool);
void STM32FXXXRccWriteEnable(void);
void STM32FXXXRccWriteDisable(void);
uint8_t STM32FXXXRccPLLSelect(uint8_t hclock);

/*******   0 -> HSI    1->HSE   *********/
#ifndef H_Clock_Source
	#define H_Clock_Source 0
#endif
/****************************************/
/****   PLL ON -> 1    PLL OFF = 0   ****/
#ifndef PLL_ON_OFF
	#define PLL_ON_OFF 0
#endif
/****************************************/

/*** RCC Procedure & Function Definition ***/
void rcc_start(void)
{	// Configure -> Enable -> Select
    // AHB 1,2,4,8,16,64,128,256,512;  APB1 1,2,4,8,16;  APB2 1,2,4,8,16;  RTC 2 to 31
	//STM32FXXXPrescaler(8, 1, 1, 1); // (8, 1, 1, 0)
	STM32FXXXPrescaler(1, 1, 1, 0); // (1, 1, 1, 0)
	STM32FXXXRccHEnable(0); // 0 - HSI
	STM32FXXXRccHEnable(1); // 1 - HSE
	STM32FXXXRccPLLSelect(H_Clock_Source); // 0 - HSI, 1 - HSE, H_Clock_Source
	// M 2 to 63;  N 50 to 432;  P 2,4,6,8;  Q 2 to 15;
	STM32FXXXPLLDivision((uint32_t)getpllclk()/1000000, 240, 2, 4);
	if(PLL_ON_OFF){
		STM32FXXXRccPLLCLKEnable();
		// System Clock Switch
		STM32FXXXRccHSelect(2); // 0 - HSI, 1 - HSE, 2 - PLL_P, 3 - PLL_R pg133 (manual 2) SW[1:0]: System clock switch
	}else{
		// System Clock Switch
		STM32FXXXRccHSelect(H_Clock_Source); // 0 - HSI, 1 - HSE, 2 - PLL_P, 3 - PLL_R pg133 (manual 2) SW[1:0]: System clock switch
	}
}
// RCC
void STM32FXXXRccHEnable(uint8_t hclock)
{
	uint8_t set;
	uint8_t rdy;
	setreg(&RCC->CR, 1, 19, 1); // CSSON
	for( set = 1, rdy = 1; rdy ; ){
		if(hclock == 0){ // HSION: Internal high-speed clock enable
			if( set ){ RCC->CR |= ( 1 << 0); set = 0; }else if( RCC->CR & ( 1 << 1) ) rdy = 0;
		}
		else if(hclock == 1){ // HSEON: HSE clock enable
			if( set ){ RCC->CR |= ( 1 << 16); set = 0; }else if( RCC->CR & ( 1 << 17) ) rdy = 0;
		}
		else if(hclock == 2){ // HSEBYP: HSE clock bypass
			if( set ){ RCC->CR |= ( 1 << 18 ); }
			hclock = 1;
		}
		else hclock = 0; // default
	}
}
uint8_t STM32FXXXRccHSelect(uint8_t hclock)
{ // SW[1:0]: System clock switch 00 - HSI, 01 - HSE pg133
	switch(hclock){
		case 0:
			setreg(&RCC->CFGR, 2, 0, 0);
		break;
		case 1: // HSE oscillator selected as system clock
			setreg(&RCC->CFGR, 2, 0, 1);
		break;
		case 2: // PLL_P selected as system clock
			setreg(&RCC->CFGR, 2, 0, 2);
		break;
		case 3: // PLL_R selected as system clock
			#ifdef STM32F446xx
				STM32FXXXRccWriteEnable();
				setreg(&RCC->CFGR, 2, 0, 3);
				STM32FXXXRccWriteDisable();
			#else
				setreg(&RCC->CFGR, 2, 0, 0);
			#endif
		break;
		default: // 00: HSI oscillator selected as system clock
			setreg(&RCC->CFGR, 2, 0, 0);
		break;
	}
	return readreg(RCC->CFGR, 2, 2);
}
uint8_t STM32FXXXRccPLLSelect(uint8_t hclock)
{ // This bit can be written only when PLL and PLLI2S are disabled
	setreg(&RCC->CR, 1, 24, 0); setreg(&RCC->CR, 1, 26, 0);
	switch(hclock){
		case 0: // HSI
			setreg(&RCC->PLLCFGR, 1, 22, 0);
		break;
		case 1: // HSE
			setreg(&RCC->PLLCFGR, 1, 22, 1);
		break;
		default: // HSI
			setreg(&RCC->PLLCFGR, 1, 22, 0);
		break;
	}
	return readreg(RCC->PLLCFGR, 1, 22);
}
void STM32FXXXRccLEnable(uint8_t lclock)
{
	uint8_t set;
	uint8_t rdy;
	for( set = 1, rdy = 1; rdy ; ){
		if(lclock == 0){ // LSION: Internal low-speed oscillator enable
			if( set ){ RCC->CSR |= ( 1 << 0); set = 0; }else if( RCC->CSR & ( 1 << 1) ) rdy = 0;
		}
		else if(lclock == 1){ // LSEON: External low-speed oscillator enable
			if( set ){ STM32FXXXRccWriteEnable(); RCC->BDCR |= ( 1 << 0); STM32FXXXRccWriteDisable(); set = 0; }else if( RCC->BDCR & ( 1 << 1) ) rdy = 0;
		}
		else if(lclock == 2){ // LSEBYP: External low-speed oscillator bypass
			if( set ){ STM32FXXXRccWriteEnable(); RCC->BDCR |= ( 1 << 2 ); STM32FXXXRccWriteDisable(); }
			lclock = 1;
		}
		else lclock = 0; // default
	}
}
void STM32FXXXRccLSelect(uint8_t lclock)
{
	switch(lclock){
		case 0: // LSI oscillator clock used as the RTC clock
			STM32FXXXRccWriteEnable();
			setreg(&RCC->BDCR, 2, 8, 2);
			STM32FXXXRccWriteDisable();
		break;
		case 1: // LSE oscillator clock used as the RTC clock
			STM32FXXXRccWriteEnable();
			setreg(&RCC->BDCR, 2, 8, 1);
			STM32FXXXRccWriteDisable();
		break;
		case 2: // HSE oscillator clock divided by a programmable prescaler
			STM32FXXXRccWriteEnable();
			setreg(&RCC->BDCR, 2, 8, 3);
			STM32FXXXRccWriteDisable();
		break;
		default: // LSE oscillator clock used as the RTC clock
			STM32FXXXRccWriteEnable();
			setreg(&RCC->BDCR, 2, 8, 1);
			STM32FXXXRccWriteDisable();
		break;
	}
}
void STM32FXXXPrescaler(uint16_t ahbpre, uint8_t ppre1, uint8_t ppre2, uint8_t rtcpre)
{
	setreg(&RCC->CFGR, 5, 16, rtcpre);
	switch(ppre2){ // 13
		case 2:
			setreg(&RCC->CFGR, 3, 13, 4);
		break;
		case 4:
			setreg(&RCC->CFGR, 3, 13, 5);
		break;
		case 8:
			setreg(&RCC->CFGR, 3, 13, 6);
		break;
		case 16:
			setreg(&RCC->CFGR, 3, 13, 7);
		break;
		default:
			setreg(&RCC->CFGR, 3, 13, 0);
		break;
	}
	switch(ppre1){ // 10
		case 2:
			setreg(&RCC->CFGR, 3, 10, 4);
		break;
		case 4:
			setreg(&RCC->CFGR, 3, 10, 5);
		break;
		case 8:
			setreg(&RCC->CFGR, 3, 10, 6);
		break;
		case 16:
			setreg(&RCC->CFGR, 3, 10, 7);
		break;
		default:
			setreg(&RCC->CFGR, 3, 10, 0);
		break;
	}
	switch(ahbpre){ // 4
		case 2:
			setreg(&RCC->CFGR, 4, 4, 8);
		break;
		case 4:
			setreg(&RCC->CFGR, 4, 4, 9);
		break;
		case 8:
			setreg(&RCC->CFGR, 4, 4, 10);
		break;
		case 16:
			setreg(&RCC->CFGR, 4, 4, 11);
		break;
		case 64:
			setreg(&RCC->CFGR, 4, 4, 12);
		break;
		case 128:
			setreg(&RCC->CFGR, 4, 4, 13);
		break;
		case 256:
			setreg(&RCC->CFGR, 4, 4, 14);
			break;
		case 512:
			setreg(&RCC->CFGR, 4, 4, 15);
			break;
		default:
			setreg(&RCC->CFGR, 4, 4, 0);
		break;
	}
}
// PLL
void STM32FXXXPLLDivision(uint8_t pllm, uint16_t plln, uint8_t pllp, uint8_t pllq)
{
	setreg(&RCC->CR, 1, 24, 0);
	setreg(&RCC->PLLCFGR,4,24,pllq);
	switch(pllp){
		case 2:
			setreg(&RCC->PLLCFGR,2,16,0);
		break;
		case 4:
			setreg(&RCC->PLLCFGR,2,16,1);
		break;
		case 6:
			setreg(&RCC->PLLCFGR,2,16,2);
		break;
		case 8:
			setreg(&RCC->PLLCFGR,2,16,3);
		break;
		default: // 2
			setreg(&RCC->PLLCFGR,2,16,0);
		break;
	}
	setreg(&RCC->PLLCFGR,9,6,plln);
	setreg(&RCC->PLLCFGR,6,0,pllm);
}
void STM32FXXXRccPLLCLKEnable(void)
{
	uint32_t rcc_time_out;
	//if(onoff){
		for( rcc_time_out = 0xFFFFFF, RCC->CR |= (1 << 24) ; !(RCC->CR & (1 << 25)) && rcc_time_out; rcc_time_out-- ); // PLLON: Main PLL (PLL) enable
	//}else{
		//RCC->CR &= (unsigned int) ~(1 << 24);
	//}
}
void STM32FXXXRccPLLI2SEnable(void)
{
	uint32_t rcc_time_out;
	//if(onoff)
		for( rcc_time_out = 0xFFFFFF, RCC->CR |= (1 << 26) ; !(RCC->CR & (1 << 27)) && rcc_time_out; rcc_time_out-- ); // PLLI2SON: PLLI2S enable
	//else
		//RCC->CR &= (unsigned int) ~(1 << 26);
}
void STM32FXXXRccPLLSAIEnable(void)
{
	uint32_t rcc_time_out;
	//if(onoff)
		for( rcc_time_out = 0xFFFFFF, RCC->CR |= (1 << 28) ; !(RCC->CR & (1 << 29)) && rcc_time_out; rcc_time_out-- ); // PLLSAION: PLLSAI enable
	//else
		//RCC->CR &= (unsigned int) ~(1 << 28);
}
void STM32FXXXRccPwrClock(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 28, bool); // Power interface clock enable
}
void STM32FXXXRccWriteEnable(void)
{
	PWR->CR |= (1 << 8); // Disable protection
}
void STM32FXXXRccWriteDisable(void)
{
	PWR->CR &= (uint32_t) ~(1 << 8); // Enable protection
}
/*** RCC Bit Mapping Definition ***/
// CR
uint8_t STM32FXXXRCC_CR_get_pllsairdy(void)
{
	return readreg(RCC->CR, 1, 29);
}
void STM32FXXXRCC_CR_pllsaion(uint8_t bool)
{
	setreg(&RCC->CR, 1, 28, bool);
}
uint8_t STM32FXXXRCC_CR_get_plli2srdy(void)
{
	return readreg(RCC->CR, 1, 27);
}
void STM32FXXXRCC_CR_plli2son(uint8_t bool)
{
	setreg(&RCC->CR, 1, 26, bool);
}
uint8_t STM32FXXXRCC_CR_get_pllrdy(void)
{
	return readreg(RCC->CR, 1, 25);
}
void STM32FXXXRCC_CR_pllon(uint8_t bool)
{
	setreg(&RCC->CR, 1, 24, bool);
}
void STM32FXXXRCC_CR_csson(uint8_t bool)
{
	setreg(&RCC->CR, 1, 19, bool);
}
void STM32FXXXRCC_CR_hsebyp(uint8_t bool)
{
	setreg(&RCC->CR, 1, 18, bool);
}
uint8_t STM32FXXXRCC_CR_get_hserdy(void)
{
	return readreg(RCC->CR, 1, 17);
}
void STM32FXXXRCC_CR_hseon(uint8_t bool)
{
	setreg(&RCC->CR, 1, 16, bool);
}
uint8_t STM32FXXXRCC_CR_get_hsical(void)
{
	return readreg(RCC->CR, 8, 8);
}
void STM32FXXXRCC_CR_hsitrim(uint8_t value)
{
	setreg(&RCC->CR, 5, 3, value);
}
uint8_t STM32FXXXRCC_CR_get_hsirdy(void)
{
	return readreg(RCC->CR, 1, 1);
}
void STM32FXXXRCC_CR_hsion(uint8_t bool)
{
	setreg(&RCC->CR, 1, 0, bool);
}
// PLLCFGR
void STM32FXXXRCC_PLLCFGR_pllr(uint8_t value)
{
	setreg(&RCC->CR, 3, 28, value);
}
void STM32FXXXRCC_PLLCFGR_pllq(uint8_t value)
{
	setreg(&RCC->CR, 4, 24, value);
}
void STM32FXXXRCC_PLLCFGR_pllsrc(uint8_t bool)
{
	setreg(&RCC->CR, 1, 22, bool);
}
void STM32FXXXRCC_PLLCFGR_pllp(uint8_t value)
{
	setreg(&RCC->CR, 2, 16, value);
}
void STM32FXXXRCC_PLLCFGR_plln(uint16_t value)
{
	setreg(&RCC->CR, 9, 6, value);
}
void STM32FXXXRCC_PLLCFGR_pllm(uint8_t value)
{
	setreg(&RCC->CR, 6, 0, value);
}
// CFGR
void STM32FXXXRCC_CFGR_mco2(uint8_t value)
{
	setreg(&RCC->CFGR, 2, 30, value);
}
void STM32FXXXRCC_CFGR_mco2pre(uint8_t value)
{
	setreg(&RCC->CFGR, 3, 27, value);
}
void STM32FXXXRCC_CFGR_mco1pre(uint8_t value)
{
	setreg(&RCC->CFGR, 3, 24, value);
}
void STM32FXXXRCC_CFGR_mco1(uint8_t value)
{
	setreg(&RCC->CFGR, 2, 21, value);
}
void STM32FXXXRCC_CFGR_rtcpre(uint8_t value)
{
	setreg(&RCC->CFGR, 5, 16, value);
}
void STM32FXXXRCC_CFGR_ppre2(uint8_t value)
{
	setreg(&RCC->CFGR, 3, 13, value);
}
void STM32FXXXRCC_CFGR_ppre1(uint8_t value)
{
	setreg(&RCC->CFGR, 3, 10, value);
}
void STM32FXXXRCC_CFGR_hpre(uint8_t value)
{
	setreg(&RCC->CFGR, 4, 4, value);
}
uint8_t STM32FXXXRCC_CFGR_get_sws(void)
{
	return readreg(RCC->CFGR, 2, 2);
}
void STM32FXXXRCC_CFGR_sw(uint8_t value)
{
	setreg(&RCC->CFGR, 2, 0, value);
}
// CIR
void STM32FXXXRCC_CIR_clear_cssc(void)
{
	setreg(&RCC->CIR, 1, 23, 1);
}
void STM32FXXXRCC_CIR_clear_pllsairdyc(void)
{
	setreg(&RCC->CIR, 1, 22, 1);
}
void STM32FXXXRCC_CIR_clear_plli2srdyc(void)
{
	setreg(&RCC->CIR, 1, 21, 1);
}
void STM32FXXXRCC_CIR_clear_pllrdyc(void)
{
	setreg(&RCC->CIR, 1, 20, 1);
}
void STM32FXXXRCC_CIR_clear_hserdyc(void)
{
	setreg(&RCC->CIR, 1, 19, 1);
}
void STM32FXXXRCC_CIR_clear_hsirdyc(void)
{
	setreg(&RCC->CIR, 1, 18, 1);
}
void STM32FXXXRCC_CIR_clear_lserdyc(void)
{
	setreg(&RCC->CIR, 1, 17, 1);
}
void STM32FXXXRCC_CIR_clear_lsirdyc(void)
{
	setreg(&RCC->CIR, 1, 16, 1);
}
void STM32FXXXRCC_CIR_pllsairdyie(uint8_t bool)
{
	setreg(&RCC->CIR, 1, 14, bool);
}
void STM32FXXXRCC_CIR_plli2srdyie(uint8_t bool)
{
	setreg(&RCC->CIR, 1, 13, bool);
}
void STM32FXXXRCC_CIR_pllrdyie(uint8_t bool)
{
	setreg(&RCC->CIR, 1, 12, bool);
}
void STM32FXXXRCC_CIR_hserdyie(uint8_t bool)
{
	setreg(&RCC->CIR, 1, 11, bool);
}
void STM32FXXXRCC_CIR_hsirdyie(uint8_t bool)
{
	setreg(&RCC->CIR, 1, 10, bool);
}
void STM32FXXXRCC_CIR_lserdyie(uint8_t bool)
{
	setreg(&RCC->CIR, 1, 9, bool);
}
void STM32FXXXRCC_CIR_lsirdyie(uint8_t bool)
{
	setreg(&RCC->CIR, 1, 8, bool);
}
uint8_t STM32FXXXRCC_CIR_get_cssf(void)
{
	return readreg(RCC->CIR, 1, 7);
}
uint8_t STM32FXXXRCC_CIR_get_pllsairdyf(void)
{
	return readreg(RCC->CIR, 1, 6);
}
uint8_t STM32FXXXRCC_CIR_get_plli2srdyf(void)
{
	return readreg(RCC->CIR, 1, 5);
}
uint8_t STM32FXXXRCC_CIR_get_pllrdyf(void)
{
	return readreg(RCC->CIR, 1, 4);
}
uint8_t STM32FXXXRCC_CIR_get_hserdyf(void)
{
	return readreg(RCC->CIR, 1, 3);
}
uint8_t STM32FXXXRCC_CIR_get_hsirdyf(void)
{
	return readreg(RCC->CIR, 1, 2);
}
uint8_t STM32FXXXRCC_CIR_get_lserdyf(void)
{
	return readreg(RCC->CIR, 1, 1);
}
uint8_t STM32FXXXRCC_CIR_get_lsirdyf(void)
{
	return readreg(RCC->CIR, 1, 0);
}
// AHB1RSTR
void STM32FXXXRCC_AHB1RSTR_otghsrst(uint8_t bool)
{
	setreg(&RCC->AHB1RSTR, 1, 29, bool);
}
void STM32FXXXRCC_AHB1RSTR_dma2rst(uint8_t bool)
{
	setreg(&RCC->AHB1RSTR, 1, 22, bool);
}
void STM32FXXXRCC_AHB1RSTR_dma1rst(uint8_t bool)
{
	setreg(&RCC->AHB1RSTR, 1, 21, bool);
}
void STM32FXXXRCC_AHB1RSTR_crcrst(uint8_t bool)
{
	setreg(&RCC->AHB1RSTR, 1, 12, bool);
}
void STM32FXXXRCC_AHB1RSTR_gpiohrst(uint8_t bool)
{
	setreg(&RCC->AHB1RSTR, 1, 7, bool);
}
void STM32FXXXRCC_AHB1RSTR_gpiogrst(uint8_t bool)
{
	setreg(&RCC->AHB1RSTR, 1, 6, bool);
}
void STM32FXXXRCC_AHB1RSTR_gpiofrst(uint8_t bool)
{
	setreg(&RCC->AHB1RSTR, 1, 5, bool);
}
void STM32FXXXRCC_AHB1RSTR_gpioerst(uint8_t bool)
{
	setreg(&RCC->AHB1RSTR, 1, 4, bool);
}
void STM32FXXXRCC_AHB1RSTR_gpiodrst(uint8_t bool)
{
	setreg(&RCC->AHB1RSTR, 1, 3, bool);
}
void STM32FXXXRCC_AHB1RSTR_gpiocrst(uint8_t bool)
{
	setreg(&RCC->AHB1RSTR, 1, 2, bool);
}
void STM32FXXXRCC_AHB1RSTR_gpiobrst(uint8_t bool)
{
	setreg(&RCC->AHB1RSTR, 1, 1, bool);
}
void STM32FXXXRCC_AHB1RSTR_gpioarst(uint8_t bool)
{
	setreg(&RCC->AHB1RSTR, 1, 0, bool);
}
// AHB2RSTR
void STM32FXXXRCC_AHB2RSTR_otgfsrst(uint8_t bool)
{
	setreg(&RCC->AHB2RSTR, 1, 7, bool);
}
void STM32FXXXRCC_AHB2RSTR_dcmirst(uint8_t bool)
{
	setreg(&RCC->AHB2RSTR, 1, 0, bool);
}
// AHB3RSTR
void STM32FXXXRCC_AHB3RSTR_qspirst(uint8_t bool)
{
	setreg(&RCC->AHB3RSTR, 1, 1, bool);
}
void STM32FXXXRCC_AHB3RSTR_fmcrst(uint8_t bool)
{
	setreg(&RCC->AHB3RSTR, 1, 0, bool);
}
// APB1RSTR
void STM32FXXXRCC_APB1RSTR_dacrst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 29, bool);
}
void STM32FXXXRCC_APB1RSTR_pwrrst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 28, bool);
}
void STM32FXXXRCC_APB1RSTR_cecrst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 27, bool);
}
void STM32FXXXRCC_APB1RSTR_can2rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 26, bool);
}
void STM32FXXXRCC_APB1RSTR_can1rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 25, bool);
}
void STM32FXXXRCC_APB1RSTR_fmpi2c1rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 24, bool);
}
void STM32FXXXRCC_APB1RSTR_i2c3rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 23, bool);
}
void STM32FXXXRCC_APB1RSTR_i2c2rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 22, bool);
}
void STM32FXXXRCC_APB1RSTR_i2c1rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 21, bool);
}
void STM32FXXXRCC_APB1RSTR_uart5rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 20, bool);
}
void STM32FXXXRCC_APB1RSTR_uart4rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 19, bool);
}
void STM32FXXXRCC_APB1RSTR_usart3rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 18, bool);
}
void STM32FXXXRCC_APB1RSTR_usart2rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 17, bool);
}
void STM32FXXXRCC_APB1RSTR_spdifrxrst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 16, bool);
}
void STM32FXXXRCC_APB1RSTR_spi3rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 15, bool);
}
void STM32FXXXRCC_APB1RSTR_spi2rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 14, bool);
}
void STM32FXXXRCC_APB1RSTR_wwdgrst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 11, bool);
}
void STM32FXXXRCC_APB1RSTR_tim14rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 8, bool);
}
void STM32FXXXRCC_APB1RSTR_tim13rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 7, bool);
}
void STM32FXXXRCC_APB1RSTR_tim12rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 6, bool);
}
void STM32FXXXRCC_APB1RSTR_tim7rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 5, bool);
}
void STM32FXXXRCC_APB1RSTR_tim6rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 4, bool);
}
void STM32FXXXRCC_APB1RSTR_tim5rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 3, bool);
}
void STM32FXXXRCC_APB1RSTR_tim4rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 2, bool);
}
void STM32FXXXRCC_APB1RSTR_tim3rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 1, bool);
}
void STM32FXXXRCC_APB1RSTR_tim2rst(uint8_t bool)
{
	setreg(&RCC->APB1RSTR, 1, 0, bool);
}
// APB2RSTR
void STM32FXXXRCC_APB2RSTR_sai2rst(uint8_t bool)
{
	setreg(&RCC->APB2RSTR, 1, 23, bool);
}
void STM32FXXXRCC_APB2RSTR_sai1rst(uint8_t bool)
{
	setreg(&RCC->APB2RSTR, 1, 22, bool);
}
void STM32FXXXRCC_APB2RSTR_tim11rst(uint8_t bool)
{
	setreg(&RCC->APB2RSTR, 1, 18, bool);
}
void STM32FXXXRCC_APB2RSTR_tim10rst(uint8_t bool)
{
	setreg(&RCC->APB2RSTR, 1, 17, bool);
}
void STM32FXXXRCC_APB2RSTR_tim9rst(uint8_t bool)
{
	setreg(&RCC->APB2RSTR, 1, 16, bool);
}
void STM32FXXXRCC_APB2RSTR_syscfgrst(uint8_t bool)
{
	setreg(&RCC->APB2RSTR, 1, 14, bool);
}
void STM32FXXXRCC_APB2RSTR_spi4rst(uint8_t bool)
{
	setreg(&RCC->APB2RSTR, 1, 13, bool);
}
void STM32FXXXRCC_APB2RSTR_spi1rst(uint8_t bool)
{
	setreg(&RCC->APB2RSTR, 1, 12, bool);
}
void STM32FXXXRCC_APB2RSTR_sdiorst(uint8_t bool)
{
	setreg(&RCC->APB2RSTR, 1, 11, bool);
}
void STM32FXXXRCC_APB2RSTR_adcrst(uint8_t bool)
{
	setreg(&RCC->APB2RSTR, 1, 8, bool);
}
void STM32FXXXRCC_APB2RSTR_usart6rst(uint8_t bool)
{
	setreg(&RCC->APB2RSTR, 1, 5, bool);
}
void STM32FXXXRCC_APB2RSTR_usart1rst(uint8_t bool)
{
	setreg(&RCC->APB2RSTR, 1, 4, bool);
}
void STM32FXXXRCC_APB2RSTR_tim8rst(uint8_t bool)
{
	setreg(&RCC->APB2RSTR, 1, 1, bool);
}
void STM32FXXXRCC_APB2RSTR_tim1rst(uint8_t bool)
{
	setreg(&RCC->APB2RSTR, 1, 0, bool);
}
// AHB1ENR
void STM32FXXXRCC_AHB1ENR_otghsulpien(uint8_t bool)
{
	setreg(&RCC->AHB1ENR, 1, 30, bool);
}
void STM32FXXXRCC_AHB1ENR_otghsen(uint8_t bool)
{
	setreg(&RCC->AHB1ENR, 1, 29, bool);
}
void STM32FXXXRCC_AHB1ENR_dma2en(uint8_t bool)
{
	setreg(&RCC->AHB1ENR, 1, 22, bool);
}
void STM32FXXXRCC_AHB1ENR_dma1en(uint8_t bool)
{
	setreg(&RCC->AHB1ENR, 1, 21, bool);
}
void STM32FXXXRCC_AHB1ENR_bkpsramen(uint8_t bool)
{
	setreg(&RCC->AHB1ENR, 1, 18, bool);
}
void STM32FXXXRCC_AHB1ENR_crcen(uint8_t bool)
{
	setreg(&RCC->AHB1ENR, 1, 12, bool);
}
void STM32FXXXRCC_AHB1ENR_gpiohen(uint8_t bool)
{
	setreg(&RCC->AHB1ENR, 1, 7, bool);
}
void STM32FXXXRCC_AHB1ENR_gpiogen(uint8_t bool)
{
	setreg(&RCC->AHB1ENR, 1, 6, bool);
}
void STM32FXXXRCC_AHB1ENR_gpiofen(uint8_t bool)
{
	setreg(&RCC->AHB1ENR, 1, 5, bool);
}
void STM32FXXXRCC_AHB1ENR_gpioeen(uint8_t bool)
{
	setreg(&RCC->AHB1ENR, 1, 4, bool);
}
void STM32FXXXRCC_AHB1ENR_gpioden(uint8_t bool)
{
	setreg(&RCC->AHB1ENR, 1, 3, bool);
}
void STM32FXXXRCC_AHB1ENR_gpiocen(uint8_t bool)
{
	setreg(&RCC->AHB1ENR, 1, 2, bool);
}
void STM32FXXXRCC_AHB1ENR_gpioben(uint8_t bool)
{
	setreg(&RCC->AHB1ENR, 1, 1, bool);
}
void STM32FXXXRCC_AHB1ENR_gpioaen(uint8_t bool)
{
	setreg(&RCC->AHB1ENR, 1, 0, bool);
}
// AHB2ENR
void STM32FXXXRCC_AHB2ENR_otgfsen(uint8_t bool)
{
	setreg(&RCC->AHB2ENR, 1, 7, bool);
}
void STM32FXXXRCC_AHB2ENR_dcmien(uint8_t bool)
{
	setreg(&RCC->AHB2ENR, 1, 0, bool);
}
// AHB3ENR
void STM32FXXXRCC_AHB3ENR_qspien(uint8_t bool)
{
	setreg(&RCC->AHB3ENR, 1, 1, bool);
}
void STM32FXXXRCC_AHB3ENR_fmcen(uint8_t bool)
{
	setreg(&RCC->AHB3ENR, 1, 0, bool);
}
// APB1ENR
void STM32FXXXRCC_APB1ENR_dacen(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 29, bool);
}
void STM32FXXXRCC_APB1ENR_pwren(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 28, bool);
}
void STM32FXXXRCC_APB1ENR_cecen(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 27, bool);
}
void STM32FXXXRCC_APB1ENR_can2en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 26, bool);
}
void STM32FXXXRCC_APB1ENR_can1en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 25, bool);
}
void STM32FXXXRCC_APB1ENR_fmpi2c1en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 24, bool);
}
void STM32FXXXRCC_APB1ENR_i2c3en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 23, bool);
}
void STM32FXXXRCC_APB1ENR_i2c2en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 22, bool);
}
void STM32FXXXRCC_APB1ENR_i2c1en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 21, bool);
}
void STM32FXXXRCC_APB1ENR_uart5en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 20, bool);
}
void STM32FXXXRCC_APB1ENR_uart4en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 19, bool);
}
void STM32FXXXRCC_APB1ENR_usart3en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 18, bool);
}
void STM32FXXXRCC_APB1ENR_usart2en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 17, bool);
}
void STM32FXXXRCC_APB1ENR_spdifrxen(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 16, bool);
}
void STM32FXXXRCC_APB1ENR_spi3en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 15, bool);
}
void STM32FXXXRCC_APB1ENR_spi2en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 14, bool);
}
void STM32FXXXRCC_APB1ENR_wwdgen(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 11, bool);
}
void STM32FXXXRCC_APB1ENR_tim14en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 8, bool);
}
void STM32FXXXRCC_APB1ENR_tim13en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 7, bool);
}
void STM32FXXXRCC_APB1ENR_tim12en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 6, bool);
}
void STM32FXXXRCC_APB1ENR_tim7en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 5, bool);
}
void STM32FXXXRCC_APB1ENR_tim6en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 4, bool);
}
void STM32FXXXRCC_APB1ENR_tim5en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 3, bool);
}
void STM32FXXXRCC_APB1ENR_tim4en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 2, bool);
}
void STM32FXXXRCC_APB1ENR_tim3en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 1, bool);
}
void STM32FXXXRCC_APB1ENR_tim2en(uint8_t bool)
{
	setreg(&RCC->APB1ENR, 1, 0, bool);
}
// APB2ENR
void STM32FXXXRCC_APB2ENR_sai2en(uint8_t bool)
{
	setreg(&RCC->APB2ENR, 1, 23, bool);
}
void STM32FXXXRCC_APB2ENR_sai1en(uint8_t bool)
{
