BitNibble/Source_Library/stm32f411lib/Library/Src/stm32411rcc.c
	setreg(&RCC->APB2ENR, 1, 22, bool);
}
void STM32FXXXRCC_APB2ENR_tim11en(uint8_t bool)
{
	setreg(&RCC->APB2ENR, 1, 18, bool);
}
void STM32FXXXRCC_APB2ENR_tim10en(uint8_t bool)
{
	setreg(&RCC->APB2ENR, 1, 17, bool);
}
void STM32FXXXRCC_APB2ENR_tim9en(uint8_t bool)
{
	setreg(&RCC->APB2ENR, 1, 16, bool);
}
void STM32FXXXRCC_APB2ENR_syscfgen(uint8_t bool)
{
	setreg(&RCC->APB2ENR, 1, 14, bool);
}
void STM32FXXXRCC_APB2ENR_spi4en(uint8_t bool)
{
	setreg(&RCC->APB2ENR, 1, 13, bool);
}
void STM32FXXXRCC_APB2ENR_spi1en(uint8_t bool)
{
	setreg(&RCC->APB2ENR, 1, 12, bool);
}
void STM32FXXXRCC_APB2ENR_sdioen(uint8_t bool)
{
	setreg(&RCC->APB2ENR, 1, 11, bool);
}
void STM32FXXXRCC_APB2ENR_adc3en(uint8_t bool)
{
	setreg(&RCC->APB2ENR, 1, 10, bool);
}
void STM32FXXXRCC_APB2ENR_adc2en(uint8_t bool)
{
	setreg(&RCC->APB2ENR, 1, 9, bool);
}
void STM32FXXXRCC_APB2ENR_adc1en(uint8_t bool)
{
	setreg(&RCC->APB2ENR, 1, 8, bool);
}
void STM32FXXXRCC_APB2ENR_usart6en(uint8_t bool)
{
	setreg(&RCC->APB2ENR, 1, 5, bool);
}
void STM32FXXXRCC_APB2ENR_usart1en(uint8_t bool)
{
	setreg(&RCC->APB2ENR, 1, 4, bool);
}
void STM32FXXXRCC_APB2ENR_tim8en(uint8_t bool)
{
	setreg(&RCC->APB2ENR, 1, 1, bool);
}
void STM32FXXXRCC_APB2ENR_tim1en(uint8_t bool)
{
	setreg(&RCC->APB2ENR, 1, 0, bool);
}
//AHB1LPENR
void STM32FXXXRCC_AHB1LPENR_otghsulpilpen(uint8_t bool)
{
	setreg(&RCC->AHB1LPENR, 1, 30, bool);
}
void STM32FXXXRCC_AHB1LPENR_otghslpen(uint8_t bool)
{
	setreg(&RCC->AHB1LPENR, 1, 29, bool);
}
void STM32FXXXRCC_AHB1LPENR_dma2lpen(uint8_t bool)
{
	setreg(&RCC->AHB1LPENR, 1, 22, bool);
}
void STM32FXXXRCC_AHB1LPENR_dma1lpen(uint8_t bool)
{
	setreg(&RCC->AHB1LPENR, 1, 21, bool);
}
void STM32FXXXRCC_AHB1LPENR_bkpsramlpen(uint8_t bool)
{
	setreg(&RCC->AHB1LPENR, 1, 18, bool);
}
void STM32FXXXRCC_AHB1LPENR_sram2lpen(uint8_t bool)
{
	setreg(&RCC->AHB1LPENR, 1, 17, bool);
}
void STM32FXXXRCC_AHB1LPENR_sram1lpen(uint8_t bool)
{
	setreg(&RCC->AHB1LPENR, 1, 16, bool);
}
void STM32FXXXRCC_AHB1LPENR_flitflpen(uint8_t bool)
{
	setreg(&RCC->AHB1LPENR, 1, 15, bool);
}
void STM32FXXXRCC_AHB1LPENR_crclpen(uint8_t bool)
{
	setreg(&RCC->AHB1LPENR, 1, 12, bool);
}
void STM32FXXXRCC_AHB1LPENR_gpiohlpen(uint8_t bool)
{
	setreg(&RCC->AHB1LPENR, 1, 7, bool);
}
void STM32FXXXRCC_AHB1LPENR_gpioglpen(uint8_t bool)
{
	setreg(&RCC->AHB1LPENR, 1, 6, bool);
}
void STM32FXXXRCC_AHB1LPENR_gpioflpen(uint8_t bool)
{
	setreg(&RCC->AHB1LPENR, 1, 5, bool);
}
void STM32FXXXRCC_AHB1LPENR_gpioelpen(uint8_t bool)
{
	setreg(&RCC->AHB1LPENR, 1, 4, bool);
}
void STM32FXXXRCC_AHB1LPENR_gpiodlpen(uint8_t bool)
{
	setreg(&RCC->AHB1LPENR, 1, 3, bool);
}
void STM32FXXXRCC_AHB1LPENR_gpioclpen(uint8_t bool)
{
	setreg(&RCC->AHB1LPENR, 1, 2, bool);
}
void STM32FXXXRCC_AHB1LPENR_gpioblpen(uint8_t bool)
{
	setreg(&RCC->AHB1LPENR, 1, 1, bool);
}
void STM32FXXXRCC_AHB1LPENR_gpioalpen(uint8_t bool)
{
	setreg(&RCC->AHB1LPENR, 1, 0, bool);
}
// AHB2LPENR
void STM32FXXXRCC_AHB2LPENR_otgfslpen(uint8_t bool)
{
	setreg(&RCC->AHB2LPENR, 1, 7, bool);
}
void STM32FXXXRCC_AHB2LPENR_dcmilpen(uint8_t bool)
{
	setreg(&RCC->AHB2LPENR, 1, 0, bool);
}
// AHB3LPENR
void STM32FXXXRCC_AHB3LPENR_qspilpen(uint8_t bool)
{
	setreg(&RCC->AHB3LPENR, 1, 1, bool);
}
void STM32FXXXRCC_AHB3LPENR_fmclpen(uint8_t bool)
{
	setreg(&RCC->AHB3LPENR, 1, 0, bool);
}
// APB1LPENR
void STM32FXXXRCC_APB1LPENR_daclpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 29, bool);
}
void STM32FXXXRCC_APB1LPENR_pwrlpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 28, bool);
}
void STM32FXXXRCC_APB1LPENR_ceclpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 27, bool);
}
void STM32FXXXRCC_APB1LPENR_can2lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 26, bool);
}
void STM32FXXXRCC_APB1LPENR_can1lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 25, bool);
}
void STM32FXXXRCC_APB1LPENR_fmpi2c1lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 24, bool);
}
void STM32FXXXRCC_APB1LPENR_i2c3lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 23, bool);
}
void STM32FXXXRCC_APB1LPENR_i2c2lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 22, bool);
}
void STM32FXXXRCC_APB1LPENR_i2c1lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 21, bool);
}
void STM32FXXXRCC_APB1LPENR_uart5lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 20, bool);
}
void STM32FXXXRCC_APB1LPENR_uart4lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 19, bool);
}
void STM32FXXXRCC_APB1LPENR_usart3lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 18, bool);
}
void STM32FXXXRCC_APB1LPENR_usart2lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 17, bool);
}
void STM32FXXXRCC_APB1LPENR_spdifrxlpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 16, bool);
}
void STM32FXXXRCC_APB1LPENR_spi3lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 15, bool);
}
void STM32FXXXRCC_APB1LPENR_spi2lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 14, bool);
}
void STM32FXXXRCC_APB1LPENR_wwdglpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 11, bool);
}
void STM32FXXXRCC_APB1LPENR_tim14lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 8, bool);
}
void STM32FXXXRCC_APB1LPENR_tim13lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 7, bool);
}
void STM32FXXXRCC_APB1LPENR_tim12lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 6, bool);
}
void STM32FXXXRCC_APB1LPENR_tim7lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 5, bool);
}
void STM32FXXXRCC_APB1LPENR_tim6lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 4, bool);
}
void STM32FXXXRCC_APB1LPENR_tim5lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 3, bool);
}
void STM32FXXXRCC_APB1LPENR_tim4lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 2, bool);
}
void STM32FXXXRCC_APB1LPENR_tim3lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 1, bool);
}
void STM32FXXXRCC_APB1LPENR_tim2lpen(uint8_t bool)
{
	setreg(&RCC->APB1LPENR, 1, 0, bool);
}
// APB2LPENR
void STM32FXXXRCC_APB2LPENR_sai2lpen(uint8_t bool)
{
	setreg(&RCC->APB2LPENR, 1, 23, bool);
}
void STM32FXXXRCC_APB2LPENR_sai1lpen(uint8_t bool)
{
	setreg(&RCC->APB2LPENR, 1, 22, bool);
}
void STM32FXXXRCC_APB2LPENR_tim11lpen(uint8_t bool)
{
	setreg(&RCC->APB2LPENR, 1, 18, bool);
}
void STM32FXXXRCC_APB2LPENR_tim10lpen(uint8_t bool)
{
	setreg(&RCC->APB2LPENR, 1, 17, bool);
}
void STM32FXXXRCC_APB2LPENR_tim9lpen(uint8_t bool)
{
	setreg(&RCC->APB2LPENR, 1, 16, bool);
}
void STM32FXXXRCC_APB2LPENR_syscfglpen(uint8_t bool)
{
	setreg(&RCC->APB2LPENR, 1, 14, bool);
}
void STM32FXXXRCC_APB2LPENR_spi4lpen(uint8_t bool)
{
	setreg(&RCC->APB2LPENR, 1, 13, bool);
}
void STM32FXXXRCC_APB2LPENR_spi1lpen(uint8_t bool)
{
	setreg(&RCC->APB2LPENR, 1, 12, bool);
}
void STM32FXXXRCC_APB2LPENR_sdiolpen(uint8_t bool)
{
	setreg(&RCC->APB2LPENR, 1, 11, bool);
}
void STM32FXXXRCC_APB2LPENR_adc3lpen(uint8_t bool)
{
	setreg(&RCC->APB2LPENR, 1, 10, bool);
}
void STM32FXXXRCC_APB2LPENR_adc2lpen(uint8_t bool)
{
	setreg(&RCC->APB2LPENR, 1, 9, bool);
}
void STM32FXXXRCC_APB2LPENR_adc1lpen(uint8_t bool)
{
	setreg(&RCC->APB2LPENR, 1, 8, bool);
}
void STM32FXXXRCC_APB2LPENR_usart6lpen(uint8_t bool)
{
	setreg(&RCC->APB2LPENR, 1, 5, bool);
}
void STM32FXXXRCC_APB2LPENR_usart1lpen(uint8_t bool)
{
	setreg(&RCC->APB2LPENR, 1, 4, bool);
}
void STM32FXXXRCC_APB2LPENR_tim8lpen(uint8_t bool)
{
	setreg(&RCC->APB2LPENR, 1, 1, bool);
}
void STM32FXXXRCC_APB2LPENR_tim1lpen(uint8_t bool)
{
	setreg(&RCC->APB2LPENR, 1, 0, bool);
}
// BDCR
void STM32FXXXRCC_BDCR_bdrst(uint8_t bool)
{
	setreg(&RCC->BDCR, 1, 16, bool);
}
void STM32FXXXRCC_BDCR_rtcen(uint8_t bool)
{
	setreg(&RCC->BDCR, 1, 15, bool);
}
uint8_t STM32FXXXRCC_BDCR_get_rtcen(void)
{
	return readreg(RCC->BDCR, 1, 15);
}
void STM32FXXXRCC_BDCR_rtcsel(uint8_t value)
{
	setreg(&RCC->BDCR, 2, 8, value);
}
uint8_t STM32FXXXRCC_BDCR_get_rtcsel(void)
{
	return readreg(RCC->BDCR, 2, 8);
}
void STM32FXXXRCC_BDCR_lsemod(uint8_t bool)
{
	setreg(&RCC->BDCR, 1, 3, bool);
}
void STM32FXXXRCC_BDCR_lsebyp(uint8_t bool)
{
	setreg(&RCC->BDCR, 1, 2, bool);
}
uint8_t STM32FXXXRCC_BDCR_get_lserdy(void)
{
	return readreg(RCC->BDCR, 1, 1);
}
void STM32FXXXRCC_BDCR_lseon(uint8_t bool)
{
	setreg(&RCC->BDCR, 1, 0, bool);
}
// CSR
uint8_t STM32FXXXRCC_CSR_get_lpwrrstf(void)
{
	return readreg(RCC->CSR, 1, 31);
}
uint8_t STM32FXXXRCC_CSR_get_wwdgrstf(void)
{
	return readreg(RCC->CSR, 1, 30);
}
uint8_t STM32FXXXRCC_CSR_get_iwdqrstf(void)
{
	return readreg(RCC->CSR, 1, 29);
}
uint8_t STM32FXXXRCC_CSR_get_sftrstf(void)
{
	return readreg(RCC->CSR, 1, 28);
}
uint8_t STM32FXXXRCC_CSR_get_porrstf(void)
{
	return readreg(RCC->CSR, 1, 27);
}
uint8_t STM32FXXXRCC_CSR_get_pinrstf(void)
{
	return readreg(RCC->CSR, 1, 26);
}
uint8_t STM32FXXXRCC_CSR_get_borrstf(void)
{
	return readreg(RCC->CSR, 1, 25);
}
void STM32FXXXRCC_CSR_clear_rmvf(void)
{
	setreg(&RCC->CSR, 1, 24, 1);
}
uint8_t STM32FXXXRCC_CSR_get_lsirdy(void)
{
	return readreg(RCC->CSR, 1, 1);
}
void STM32FXXXRCC_CSR_lsion(uint8_t bool)
{
	setreg(&RCC->CSR, 1, 0, bool);
}
// SSCGR
void STM32FXXXRCC_SSCGR_sscgen(uint8_t bool)
{
	setreg(&RCC->SSCGR, 1, 31, bool);
}
void STM32FXXXRCC_SSCGR_spreadsel(uint8_t bool)
{
	setreg(&RCC->SSCGR, 1, 30, bool);
}
void STM32FXXXRCC_SSCGR_incstep(uint8_t value)
{
	setreg(&RCC->SSCGR, 15, 13, value);
}
void STM32FXXXRCC_SSCGR_modper(uint8_t value)
{
	setreg(&RCC->SSCGR, 13, 0, value);
}
// PLLI2SCFGR
void STM32FXXXRCC_PLLI2SCFGR_plli2sr(uint8_t value)
{
	setreg(&RCC->PLLI2SCFGR, 3, 28, value);
}
void STM32FXXXRCC_PLLI2SCFGR_plli2sq(uint8_t value)
{
	setreg(&RCC->PLLI2SCFGR, 4, 24, value);
}
void STM32FXXXRCC_PLLI2SCFGR_plli2sp(uint8_t value)
{
	setreg(&RCC->PLLI2SCFGR, 2, 16, value);
}
void STM32FXXXRCC_PLLI2SCFGR_plli2sn(uint16_t value)
{
	setreg(&RCC->PLLI2SCFGR, 9, 6, value);
}
void STM32FXXXRCC_PLLI2SCFGR_plli2sm(uint8_t value)
{
	setreg(&RCC->PLLI2SCFGR, 6, 0, value);
}
// DCKCFGR
void STM32FXXXRCC_DCKCFGR_i2s2src(uint8_t value)
{
	setreg(&RCC->DCKCFGR, 2, 27, value);
}
void STM32FXXXRCC_DCKCFGR_i2s1src(uint8_t value)
{
	setreg(&RCC->DCKCFGR, 2, 25, value);
}
void STM32FXXXRCC_DCKCFGR_timpre(uint8_t bool)
{
	setreg(&RCC->DCKCFGR, 1, 24, bool);
}
void STM32FXXXRCC_DCKCFGR_sai2src(uint8_t value)
{
	setreg(&RCC->DCKCFGR, 2, 22, value);
}
void STM32FXXXRCC_DCKCFGR_sai1src(uint8_t value)
{
	setreg(&RCC->DCKCFGR, 2, 20, value);
}
void STM32FXXXRCC_DCKCFGR_pllsaidivq(uint8_t value)
{
	setreg(&RCC->DCKCFGR, 5, 8, value);
}
void STM32FXXXRCC_DCKCFGR_plli2sdivq(uint8_t value)
{
	setreg(&RCC->DCKCFGR, 5, 0, value);
}
/*** Other ***/
void STM32FXXXRCC_nvic(uint8_t bool)
{
	if(bool){ setbit(NVIC->ISER, 1, RCC_IRQn, 1); } else{ setbit(NVIC->ICER, 1, RCC_IRQn, 1); }
}
/*** Auxiliar ***/
STM32FXXXRCC_cr* stm32fxxx_rcc_cr_inic(void)
{

	// CR
	stm32fxxx_rcc_cr.get_pllsairdy = STM32FXXXRCC_CR_get_pllsairdy;
	stm32fxxx_rcc_cr.pllsaion = STM32FXXXRCC_CR_pllsaion;
	stm32fxxx_rcc_cr.get_plli2srdy = STM32FXXXRCC_CR_get_plli2srdy;
	stm32fxxx_rcc_cr.plli2son = STM32FXXXRCC_CR_plli2son;
	stm32fxxx_rcc_cr.get_pllrdy = STM32FXXXRCC_CR_get_pllrdy;
	stm32fxxx_rcc_cr.pllon = STM32FXXXRCC_CR_pllon;
	stm32fxxx_rcc_cr.csson = STM32FXXXRCC_CR_csson;
	stm32fxxx_rcc_cr.hsebyp = STM32FXXXRCC_CR_hsebyp;
	stm32fxxx_rcc_cr.get_hserdy = STM32FXXXRCC_CR_get_hserdy;
	stm32fxxx_rcc_cr.hseon = STM32FXXXRCC_CR_hseon;
	stm32fxxx_rcc_cr.get_hsical = STM32FXXXRCC_CR_get_hsical;
	stm32fxxx_rcc_cr.hsitrim = STM32FXXXRCC_CR_hsitrim;
	stm32fxxx_rcc_cr.get_hsirdy = STM32FXXXRCC_CR_get_hsirdy;
	stm32fxxx_rcc_cr.hsion = STM32FXXXRCC_CR_hsion;
	return &stm32fxxx_rcc_cr;
}
STM32FXXXRCC_pllcfgr* stm32fxxx_rcc_pllcfgr_inic(void)
{

