BitNibble/Source_Library/stm32f411lib/Library/Src/stm32411rcc.c
	// PLLCFGR
	stm32fxxx_rcc_pllcfgr.pllr = STM32FXXXRCC_PLLCFGR_pllr;
	stm32fxxx_rcc_pllcfgr.pllq = STM32FXXXRCC_PLLCFGR_pllq;
	stm32fxxx_rcc_pllcfgr.pllsrc = STM32FXXXRCC_PLLCFGR_pllsrc;
	stm32fxxx_rcc_pllcfgr.pllp = STM32FXXXRCC_PLLCFGR_pllp;
	stm32fxxx_rcc_pllcfgr.plln = STM32FXXXRCC_PLLCFGR_plln;
	stm32fxxx_rcc_pllcfgr.pllm = STM32FXXXRCC_PLLCFGR_pllm;
	return &stm32fxxx_rcc_pllcfgr;
}
STM32FXXXRCC_cfgr* stm32fxxx_rcc_cfgr_inic(void)
{

	// CFGR
	stm32fxxx_rcc_cfgr.mco2 = STM32FXXXRCC_CFGR_mco2;
	stm32fxxx_rcc_cfgr.mco2pre = STM32FXXXRCC_CFGR_mco2pre;
	stm32fxxx_rcc_cfgr.mco1pre = STM32FXXXRCC_CFGR_mco1pre;
	stm32fxxx_rcc_cfgr.mco1 = STM32FXXXRCC_CFGR_mco1;
	stm32fxxx_rcc_cfgr.rtcpre = STM32FXXXRCC_CFGR_rtcpre;
	stm32fxxx_rcc_cfgr.ppre2 = STM32FXXXRCC_CFGR_ppre2;
	stm32fxxx_rcc_cfgr.ppre1 = STM32FXXXRCC_CFGR_ppre1;
	stm32fxxx_rcc_cfgr.hpre = STM32FXXXRCC_CFGR_hpre;
	stm32fxxx_rcc_cfgr.get_sws = STM32FXXXRCC_CFGR_get_sws;
	stm32fxxx_rcc_cfgr.sw = STM32FXXXRCC_CFGR_sw;
	return &stm32fxxx_rcc_cfgr;
}
STM32FXXXRCC_cir* stm32fxxx_rcc_cir_inic(void)
{

	// CIR
	stm32fxxx_rcc_cir.clear_cssc = STM32FXXXRCC_CIR_clear_cssc;
	stm32fxxx_rcc_cir.clear_pllsairdyc = STM32FXXXRCC_CIR_clear_pllsairdyc;
	stm32fxxx_rcc_cir.clear_plli2srdyc = STM32FXXXRCC_CIR_clear_plli2srdyc;
	stm32fxxx_rcc_cir.clear_pllrdyc = STM32FXXXRCC_CIR_clear_pllrdyc;
	stm32fxxx_rcc_cir.clear_hserdyc = STM32FXXXRCC_CIR_clear_hserdyc;
	stm32fxxx_rcc_cir.clear_hsirdyc = STM32FXXXRCC_CIR_clear_hsirdyc;
	stm32fxxx_rcc_cir.clear_lserdyc = STM32FXXXRCC_CIR_clear_lserdyc;
	stm32fxxx_rcc_cir.clear_lsirdyc = STM32FXXXRCC_CIR_clear_lsirdyc;
	stm32fxxx_rcc_cir.pllsairdyie = STM32FXXXRCC_CIR_pllsairdyie;
	stm32fxxx_rcc_cir.plli2srdyie = STM32FXXXRCC_CIR_plli2srdyie;
	stm32fxxx_rcc_cir.pllrdyie = STM32FXXXRCC_CIR_pllrdyie;
	stm32fxxx_rcc_cir.hserdyie = STM32FXXXRCC_CIR_hserdyie;
	stm32fxxx_rcc_cir.hsirdyie = STM32FXXXRCC_CIR_hsirdyie;
	stm32fxxx_rcc_cir.lserdyie = STM32FXXXRCC_CIR_lserdyie;
	stm32fxxx_rcc_cir.lsirdyie = STM32FXXXRCC_CIR_lsirdyie;
	stm32fxxx_rcc_cir.get_cssf = STM32FXXXRCC_CIR_get_cssf;
	stm32fxxx_rcc_cir.get_pllsairdyf = STM32FXXXRCC_CIR_get_pllsairdyf;
	stm32fxxx_rcc_cir.get_plli2srdyf = STM32FXXXRCC_CIR_get_plli2srdyf;
	stm32fxxx_rcc_cir.get_pllrdyf = STM32FXXXRCC_CIR_get_pllrdyf;
	stm32fxxx_rcc_cir.get_hserdyf = STM32FXXXRCC_CIR_get_hserdyf;
	stm32fxxx_rcc_cir.get_hsirdyf = STM32FXXXRCC_CIR_get_hsirdyf;
	stm32fxxx_rcc_cir.get_lserdyf = STM32FXXXRCC_CIR_get_lserdyf;
	stm32fxxx_rcc_cir.get_lsirdyf = STM32FXXXRCC_CIR_get_lsirdyf;
	return &stm32fxxx_rcc_cir;
}
STM32FXXXRCC_ahb1rstr* stm32fxxx_rcc_ahb1rstr_inic(void)
{

	// AHB1RSTR
	stm32fxxx_rcc_ahb1rstr.otghsrst = STM32FXXXRCC_AHB1RSTR_otghsrst;
	stm32fxxx_rcc_ahb1rstr.dma2rst = STM32FXXXRCC_AHB1RSTR_dma2rst;
	stm32fxxx_rcc_ahb1rstr.dma1rst = STM32FXXXRCC_AHB1RSTR_dma1rst;
	stm32fxxx_rcc_ahb1rstr.crcrst = STM32FXXXRCC_AHB1RSTR_crcrst;
	stm32fxxx_rcc_ahb1rstr.gpiohrst = STM32FXXXRCC_AHB1RSTR_gpiohrst;
	stm32fxxx_rcc_ahb1rstr.gpiogrst = STM32FXXXRCC_AHB1RSTR_gpiogrst;
	stm32fxxx_rcc_ahb1rstr.gpiofrst = STM32FXXXRCC_AHB1RSTR_gpiofrst;
	stm32fxxx_rcc_ahb1rstr.gpioerst = STM32FXXXRCC_AHB1RSTR_gpioerst;
	stm32fxxx_rcc_ahb1rstr.gpiodrst = STM32FXXXRCC_AHB1RSTR_gpiodrst;
	stm32fxxx_rcc_ahb1rstr.gpiocrst = STM32FXXXRCC_AHB1RSTR_gpiocrst;
	stm32fxxx_rcc_ahb1rstr.gpiobrst = STM32FXXXRCC_AHB1RSTR_gpiobrst;
	stm32fxxx_rcc_ahb1rstr.gpioarst = STM32FXXXRCC_AHB1RSTR_gpioarst;
	return &stm32fxxx_rcc_ahb1rstr;
}
STM32FXXXRCC_ahb2rstr* stm32fxxx_rcc_ahb2rstr_inic(void)
{

	// AHB2RSTR
	stm32fxxx_rcc_ahb2rstr.otgfsrst = STM32FXXXRCC_AHB2RSTR_otgfsrst;
	stm32fxxx_rcc_ahb2rstr.dcmirst = STM32FXXXRCC_AHB2RSTR_dcmirst;
	return &stm32fxxx_rcc_ahb2rstr;
}
STM32FXXXRCC_apb1rstr* stm32fxxx_rcc_apb1rstr_inic(void)
{

	// APB1RSTR
	stm32fxxx_rcc_apb1rstr.dacrst = STM32FXXXRCC_APB1RSTR_dacrst;
	stm32fxxx_rcc_apb1rstr.pwrrst = STM32FXXXRCC_APB1RSTR_pwrrst;
	stm32fxxx_rcc_apb1rstr.cecrst = STM32FXXXRCC_APB1RSTR_cecrst;
	stm32fxxx_rcc_apb1rstr.can2rst = STM32FXXXRCC_APB1RSTR_can2rst;
	stm32fxxx_rcc_apb1rstr.can1rst = STM32FXXXRCC_APB1RSTR_can1rst;
	stm32fxxx_rcc_apb1rstr.fmpi2c1rst = STM32FXXXRCC_APB1RSTR_fmpi2c1rst;
	stm32fxxx_rcc_apb1rstr.i2c3rst = STM32FXXXRCC_APB1RSTR_i2c3rst;
	stm32fxxx_rcc_apb1rstr.i2c2rst = STM32FXXXRCC_APB1RSTR_i2c2rst;
	stm32fxxx_rcc_apb1rstr.i2c1rst = STM32FXXXRCC_APB1RSTR_i2c1rst;
	stm32fxxx_rcc_apb1rstr.uart5rst = STM32FXXXRCC_APB1RSTR_uart5rst;
	stm32fxxx_rcc_apb1rstr.uart4rst = STM32FXXXRCC_APB1RSTR_uart4rst;
	stm32fxxx_rcc_apb1rstr.usart3rst = STM32FXXXRCC_APB1RSTR_usart3rst;
	stm32fxxx_rcc_apb1rstr.usart2rst = STM32FXXXRCC_APB1RSTR_usart2rst;
	stm32fxxx_rcc_apb1rstr.spdifrxrst = STM32FXXXRCC_APB1RSTR_spdifrxrst;
	stm32fxxx_rcc_apb1rstr.spi3rst = STM32FXXXRCC_APB1RSTR_spi3rst;
	stm32fxxx_rcc_apb1rstr.spi2rst = STM32FXXXRCC_APB1RSTR_spi2rst;
	stm32fxxx_rcc_apb1rstr.wwdgrst = STM32FXXXRCC_APB1RSTR_wwdgrst;
	stm32fxxx_rcc_apb1rstr.tim14rst = STM32FXXXRCC_APB1RSTR_tim14rst;
	stm32fxxx_rcc_apb1rstr.tim13rst = STM32FXXXRCC_APB1RSTR_tim13rst;
	stm32fxxx_rcc_apb1rstr.tim12rst = STM32FXXXRCC_APB1RSTR_tim12rst;
	stm32fxxx_rcc_apb1rstr.tim7rst = STM32FXXXRCC_APB1RSTR_tim7rst;
	stm32fxxx_rcc_apb1rstr.tim6rst = STM32FXXXRCC_APB1RSTR_tim6rst;
	stm32fxxx_rcc_apb1rstr.tim5rst = STM32FXXXRCC_APB1RSTR_tim5rst;
	stm32fxxx_rcc_apb1rstr.tim4rst = STM32FXXXRCC_APB1RSTR_tim4rst;
	stm32fxxx_rcc_apb1rstr.tim3rst = STM32FXXXRCC_APB1RSTR_tim3rst;
	stm32fxxx_rcc_apb1rstr.tim2rst = STM32FXXXRCC_APB1RSTR_tim2rst;
	return &stm32fxxx_rcc_apb1rstr;
}
STM32FXXXRCC_apb2rstr* stm32fxxx_rcc_apb2rstr_inic(void)
{

	// APB2RSTR
	stm32fxxx_rcc_apb2rstr.sai2rst = STM32FXXXRCC_APB2RSTR_sai2rst;
	stm32fxxx_rcc_apb2rstr.sai1rst = STM32FXXXRCC_APB2RSTR_sai1rst;
	stm32fxxx_rcc_apb2rstr.tim11rst = STM32FXXXRCC_APB2RSTR_tim11rst;
	stm32fxxx_rcc_apb2rstr.tim10rst = STM32FXXXRCC_APB2RSTR_tim10rst;
	stm32fxxx_rcc_apb2rstr.tim9rst = STM32FXXXRCC_APB2RSTR_tim9rst;
	stm32fxxx_rcc_apb2rstr.syscfgrst = STM32FXXXRCC_APB2RSTR_syscfgrst;
	stm32fxxx_rcc_apb2rstr.spi4rst = STM32FXXXRCC_APB2RSTR_spi4rst;
	stm32fxxx_rcc_apb2rstr.spi1rst = STM32FXXXRCC_APB2RSTR_spi1rst;
	stm32fxxx_rcc_apb2rstr.sdiorst = STM32FXXXRCC_APB2RSTR_sdiorst;
	stm32fxxx_rcc_apb2rstr.adcrst = STM32FXXXRCC_APB2RSTR_adcrst;
	stm32fxxx_rcc_apb2rstr.usart6rst = STM32FXXXRCC_APB2RSTR_usart6rst;
	stm32fxxx_rcc_apb2rstr.usart1rst = STM32FXXXRCC_APB2RSTR_usart1rst;
	stm32fxxx_rcc_apb2rstr.tim8rst = STM32FXXXRCC_APB2RSTR_tim8rst;
	stm32fxxx_rcc_apb2rstr.tim1rst = STM32FXXXRCC_APB2RSTR_tim1rst;
	return &stm32fxxx_rcc_apb2rstr;
}
STM32FXXXRCC_ahb1enr* stm32fxxx_rcc_ahb1enr_inic(void)
{

	// AHB1ENR
	stm32fxxx_rcc_ahb1enr.otghsulpien = STM32FXXXRCC_AHB1ENR_otghsulpien;
	stm32fxxx_rcc_ahb1enr.otghsen = STM32FXXXRCC_AHB1ENR_otghsen;
	stm32fxxx_rcc_ahb1enr.dma2en = STM32FXXXRCC_AHB1ENR_dma2en;
	stm32fxxx_rcc_ahb1enr.dma1en = STM32FXXXRCC_AHB1ENR_dma1en;
	stm32fxxx_rcc_ahb1enr.bkpsramen = STM32FXXXRCC_AHB1ENR_bkpsramen;
	stm32fxxx_rcc_ahb1enr.crcen = STM32FXXXRCC_AHB1ENR_crcen;
	stm32fxxx_rcc_ahb1enr.gpiohen = STM32FXXXRCC_AHB1ENR_gpiohen;
	stm32fxxx_rcc_ahb1enr.gpiogen = STM32FXXXRCC_AHB1ENR_gpiogen;
	stm32fxxx_rcc_ahb1enr.gpiofen = STM32FXXXRCC_AHB1ENR_gpiofen;
	stm32fxxx_rcc_ahb1enr.gpioeen = STM32FXXXRCC_AHB1ENR_gpioeen;
	stm32fxxx_rcc_ahb1enr.gpioden = STM32FXXXRCC_AHB1ENR_gpioden;
	stm32fxxx_rcc_ahb1enr.gpiocen = STM32FXXXRCC_AHB1ENR_gpiocen;
	stm32fxxx_rcc_ahb1enr.gpioben = STM32FXXXRCC_AHB1ENR_gpioben;
	stm32fxxx_rcc_ahb1enr.gpioaen = STM32FXXXRCC_AHB1ENR_gpioaen;
	return &stm32fxxx_rcc_ahb1enr;
}
STM32FXXXRCC_ahb2enr* stm32fxxx_rcc_ahb2enr_inic(void)
{

