BitNibble/Source_Library/stm32f411lib/Library/Src/stm32411rcc.c
	// AHB2ENR
	stm32fxxx_rcc_ahb2enr.otgfsen = STM32FXXXRCC_AHB2ENR_otgfsen;
	stm32fxxx_rcc_ahb2enr.dcmien = STM32FXXXRCC_AHB2ENR_dcmien;
	return &stm32fxxx_rcc_ahb2enr;
}
STM32FXXXRCC_apb1enr* stm32fxxx_rcc_apb1enr_inic(void)
{

	// APB1ENR
	stm32fxxx_rcc_apb1enr.dacen = STM32FXXXRCC_APB1ENR_dacen;
	stm32fxxx_rcc_apb1enr.pwren = STM32FXXXRCC_APB1ENR_pwren;
	stm32fxxx_rcc_apb1enr.cecen = STM32FXXXRCC_APB1ENR_cecen;
	stm32fxxx_rcc_apb1enr.can2en = STM32FXXXRCC_APB1ENR_can2en;
	stm32fxxx_rcc_apb1enr.can1en = STM32FXXXRCC_APB1ENR_can1en;
	stm32fxxx_rcc_apb1enr.fmpi2c1en = STM32FXXXRCC_APB1ENR_fmpi2c1en;
	stm32fxxx_rcc_apb1enr.i2c3en = STM32FXXXRCC_APB1ENR_i2c3en;
	stm32fxxx_rcc_apb1enr.i2c2en = STM32FXXXRCC_APB1ENR_i2c2en;
	stm32fxxx_rcc_apb1enr.i2c1en = STM32FXXXRCC_APB1ENR_i2c1en;
	stm32fxxx_rcc_apb1enr.uart5en = STM32FXXXRCC_APB1ENR_uart5en;
	stm32fxxx_rcc_apb1enr.uart4en = STM32FXXXRCC_APB1ENR_uart4en;
	stm32fxxx_rcc_apb1enr.usart3en = STM32FXXXRCC_APB1ENR_usart3en;
	stm32fxxx_rcc_apb1enr.usart2en = STM32FXXXRCC_APB1ENR_usart2en;
	stm32fxxx_rcc_apb1enr.spdifrxen = STM32FXXXRCC_APB1ENR_spdifrxen;
	stm32fxxx_rcc_apb1enr.spi3en = STM32FXXXRCC_APB1ENR_spi3en;
	stm32fxxx_rcc_apb1enr.spi2en = STM32FXXXRCC_APB1ENR_spi2en;
	stm32fxxx_rcc_apb1enr.wwdgen = STM32FXXXRCC_APB1ENR_wwdgen;
	stm32fxxx_rcc_apb1enr.tim14en = STM32FXXXRCC_APB1ENR_tim14en;
	stm32fxxx_rcc_apb1enr.tim13en = STM32FXXXRCC_APB1ENR_tim13en;
	stm32fxxx_rcc_apb1enr.tim12en = STM32FXXXRCC_APB1ENR_tim12en;
	stm32fxxx_rcc_apb1enr.tim7en = STM32FXXXRCC_APB1ENR_tim7en;
	stm32fxxx_rcc_apb1enr.tim6en = STM32FXXXRCC_APB1ENR_tim6en;
	stm32fxxx_rcc_apb1enr.tim5en = STM32FXXXRCC_APB1ENR_tim5en;
	stm32fxxx_rcc_apb1enr.tim4en = STM32FXXXRCC_APB1ENR_tim4en;
	stm32fxxx_rcc_apb1enr.tim3en = STM32FXXXRCC_APB1ENR_tim3en;
	stm32fxxx_rcc_apb1enr.tim2en = STM32FXXXRCC_APB1ENR_tim2en;
	return &stm32fxxx_rcc_apb1enr;
}
STM32FXXXRCC_apb2enr* stm32fxxx_rcc_apb2enr_inic(void)
{

	// APB2ENR
	stm32fxxx_rcc_apb2enr.sai2en = STM32FXXXRCC_APB2ENR_sai2en;
	stm32fxxx_rcc_apb2enr.sai1en = STM32FXXXRCC_APB2ENR_sai1en;
	stm32fxxx_rcc_apb2enr.tim11en = STM32FXXXRCC_APB2ENR_tim11en;
	stm32fxxx_rcc_apb2enr.tim10en = STM32FXXXRCC_APB2ENR_tim10en;
	stm32fxxx_rcc_apb2enr.tim9en = STM32FXXXRCC_APB2ENR_tim9en;
	stm32fxxx_rcc_apb2enr.syscfgen = STM32FXXXRCC_APB2ENR_syscfgen;
	stm32fxxx_rcc_apb2enr.spi4en = STM32FXXXRCC_APB2ENR_spi4en;
	stm32fxxx_rcc_apb2enr.spi1en = STM32FXXXRCC_APB2ENR_spi1en;
	stm32fxxx_rcc_apb2enr.sdioen = STM32FXXXRCC_APB2ENR_sdioen;
	stm32fxxx_rcc_apb2enr.adc3en = STM32FXXXRCC_APB2ENR_adc3en;
	stm32fxxx_rcc_apb2enr.adc2en = STM32FXXXRCC_APB2ENR_adc2en;
	stm32fxxx_rcc_apb2enr.adc1en = STM32FXXXRCC_APB2ENR_adc1en;
	stm32fxxx_rcc_apb2enr.usart6en = STM32FXXXRCC_APB2ENR_usart6en;
	stm32fxxx_rcc_apb2enr.usart1en = STM32FXXXRCC_APB2ENR_usart1en;
	stm32fxxx_rcc_apb2enr.tim8en = STM32FXXXRCC_APB2ENR_tim8en;
	stm32fxxx_rcc_apb2enr.tim1en = STM32FXXXRCC_APB2ENR_tim1en;
	return &stm32fxxx_rcc_apb2enr;
}
STM32FXXXRCC_ahb1lpenr* stm32fxxx_rcc_ahb1lpenr_inic(void)
{

	//AHB1LPENR
	stm32fxxx_rcc_ahb1lpenr.otghsulpilpen = STM32FXXXRCC_AHB1LPENR_otghsulpilpen;
	stm32fxxx_rcc_ahb1lpenr.otghslpen = STM32FXXXRCC_AHB1LPENR_otghslpen;
	stm32fxxx_rcc_ahb1lpenr.dma2lpen = STM32FXXXRCC_AHB1LPENR_dma2lpen;
	stm32fxxx_rcc_ahb1lpenr.dma1lpen = STM32FXXXRCC_AHB1LPENR_dma1lpen;
	stm32fxxx_rcc_ahb1lpenr.bkpsramlpen = STM32FXXXRCC_AHB1LPENR_bkpsramlpen;
	stm32fxxx_rcc_ahb1lpenr.sram2lpen = STM32FXXXRCC_AHB1LPENR_sram2lpen;
	stm32fxxx_rcc_ahb1lpenr.sram1lpen = STM32FXXXRCC_AHB1LPENR_sram1lpen;
	stm32fxxx_rcc_ahb1lpenr.flitflpen = STM32FXXXRCC_AHB1LPENR_flitflpen;
	stm32fxxx_rcc_ahb1lpenr.crclpen = STM32FXXXRCC_AHB1LPENR_crclpen;
	stm32fxxx_rcc_ahb1lpenr.gpiohlpen = STM32FXXXRCC_AHB1LPENR_gpiohlpen;
	stm32fxxx_rcc_ahb1lpenr.gpioglpen = STM32FXXXRCC_AHB1LPENR_gpioglpen;
	stm32fxxx_rcc_ahb1lpenr.gpioflpen = STM32FXXXRCC_AHB1LPENR_gpioflpen;
	stm32fxxx_rcc_ahb1lpenr.gpioelpen = STM32FXXXRCC_AHB1LPENR_gpioelpen;
	stm32fxxx_rcc_ahb1lpenr.gpiodlpen = STM32FXXXRCC_AHB1LPENR_gpiodlpen;
	stm32fxxx_rcc_ahb1lpenr.gpioclpen = STM32FXXXRCC_AHB1LPENR_gpioclpen;
	stm32fxxx_rcc_ahb1lpenr.gpioblpen = STM32FXXXRCC_AHB1LPENR_gpioblpen;
	stm32fxxx_rcc_ahb1lpenr.gpioalpen = STM32FXXXRCC_AHB1LPENR_gpioalpen;
	return &stm32fxxx_rcc_ahb1lpenr;
}
STM32FXXXRCC_ahb2lpenr* stm32fxxx_rcc_ahb2lpenr_inic(void)
{

	// AHB2LPENR
	stm32fxxx_rcc_ahb2lpenr.otgfslpen = STM32FXXXRCC_AHB2LPENR_otgfslpen;
	stm32fxxx_rcc_ahb2lpenr.dcmilpen = STM32FXXXRCC_AHB2LPENR_dcmilpen;
	return &stm32fxxx_rcc_ahb2lpenr;
}
STM32FXXXRCC_apb1lpenr* stm32fxxx_rcc_apb1lpenr_inic(void)
{

	// APB1LPENR
	stm32fxxx_rcc_apb1lpenr.daclpen = STM32FXXXRCC_APB1LPENR_daclpen;
	stm32fxxx_rcc_apb1lpenr.pwrlpen = STM32FXXXRCC_APB1LPENR_pwrlpen;
	stm32fxxx_rcc_apb1lpenr.ceclpen = STM32FXXXRCC_APB1LPENR_ceclpen;
	stm32fxxx_rcc_apb1lpenr.can2lpen = STM32FXXXRCC_APB1LPENR_can2lpen;
	stm32fxxx_rcc_apb1lpenr.can1lpen = STM32FXXXRCC_APB1LPENR_can1lpen;
	stm32fxxx_rcc_apb1lpenr.fmpi2c1lpen = STM32FXXXRCC_APB1LPENR_fmpi2c1lpen;
	stm32fxxx_rcc_apb1lpenr.i2c3lpen = STM32FXXXRCC_APB1LPENR_i2c3lpen;
	stm32fxxx_rcc_apb1lpenr.i2c2lpen = STM32FXXXRCC_APB1LPENR_i2c2lpen;
	stm32fxxx_rcc_apb1lpenr.i2c1lpen = STM32FXXXRCC_APB1LPENR_i2c1lpen;
	stm32fxxx_rcc_apb1lpenr.uart5lpen = STM32FXXXRCC_APB1LPENR_uart5lpen;
	stm32fxxx_rcc_apb1lpenr.uart4lpen = STM32FXXXRCC_APB1LPENR_uart4lpen;
	stm32fxxx_rcc_apb1lpenr.usart3lpen = STM32FXXXRCC_APB1LPENR_usart3lpen;
	stm32fxxx_rcc_apb1lpenr.usart2lpen = STM32FXXXRCC_APB1LPENR_usart2lpen;
	stm32fxxx_rcc_apb1lpenr.spdifrxlpen = STM32FXXXRCC_APB1LPENR_spdifrxlpen;
	stm32fxxx_rcc_apb1lpenr.spi3lpen = STM32FXXXRCC_APB1LPENR_spi3lpen;
	stm32fxxx_rcc_apb1lpenr.spi2lpen = STM32FXXXRCC_APB1LPENR_spi2lpen;
	stm32fxxx_rcc_apb1lpenr.wwdglpen = STM32FXXXRCC_APB1LPENR_wwdglpen;
	stm32fxxx_rcc_apb1lpenr.tim14lpen = STM32FXXXRCC_APB1LPENR_tim14lpen;
	stm32fxxx_rcc_apb1lpenr.tim13lpen = STM32FXXXRCC_APB1LPENR_tim13lpen;
	stm32fxxx_rcc_apb1lpenr.tim12lpen = STM32FXXXRCC_APB1LPENR_tim12lpen;
	stm32fxxx_rcc_apb1lpenr.tim7lpen = STM32FXXXRCC_APB1LPENR_tim7lpen;
	stm32fxxx_rcc_apb1lpenr.tim6lpen = STM32FXXXRCC_APB1LPENR_tim6lpen;
	stm32fxxx_rcc_apb1lpenr.tim5lpen = STM32FXXXRCC_APB1LPENR_tim5lpen;
	stm32fxxx_rcc_apb1lpenr.tim4lpen = STM32FXXXRCC_APB1LPENR_tim4lpen;
	stm32fxxx_rcc_apb1lpenr.tim3lpen = STM32FXXXRCC_APB1LPENR_tim3lpen;
	stm32fxxx_rcc_apb1lpenr.tim2lpen = STM32FXXXRCC_APB1LPENR_tim2lpen;
	return &stm32fxxx_rcc_apb1lpenr;
}
STM32FXXXRCC_apb2lpenr* stm32fxxx_rcc_apb2lpenr_inic(void)
{

	// APB2LPENR
	stm32fxxx_rcc_apb2lpenr.sai2lpen = STM32FXXXRCC_APB2LPENR_sai2lpen;
	stm32fxxx_rcc_apb2lpenr.sai1lpen = STM32FXXXRCC_APB2LPENR_sai1lpen;
	stm32fxxx_rcc_apb2lpenr.tim11lpen = STM32FXXXRCC_APB2LPENR_tim11lpen;
	stm32fxxx_rcc_apb2lpenr.tim10lpen = STM32FXXXRCC_APB2LPENR_tim10lpen;
	stm32fxxx_rcc_apb2lpenr.tim9lpen = STM32FXXXRCC_APB2LPENR_tim9lpen;
	stm32fxxx_rcc_apb2lpenr.syscfglpen = STM32FXXXRCC_APB2LPENR_syscfglpen;
	stm32fxxx_rcc_apb2lpenr.spi4lpen = STM32FXXXRCC_APB2LPENR_spi4lpen;
	stm32fxxx_rcc_apb2lpenr.sai1lpen = STM32FXXXRCC_APB2LPENR_spi1lpen;
	stm32fxxx_rcc_apb2lpenr.sdiolpen = STM32FXXXRCC_APB2LPENR_sdiolpen;
	stm32fxxx_rcc_apb2lpenr.adc3lpen = STM32FXXXRCC_APB2LPENR_adc3lpen;
	stm32fxxx_rcc_apb2lpenr.adc2lpen = STM32FXXXRCC_APB2LPENR_adc2lpen;
	stm32fxxx_rcc_apb2lpenr.adc1lpen = STM32FXXXRCC_APB2LPENR_adc1lpen;
	stm32fxxx_rcc_apb2lpenr.usart6lpen = STM32FXXXRCC_APB2LPENR_usart6lpen;
	stm32fxxx_rcc_apb2lpenr.usart1lpen = STM32FXXXRCC_APB2LPENR_usart1lpen;
	stm32fxxx_rcc_apb2lpenr.tim8lpen = STM32FXXXRCC_APB2LPENR_tim8lpen;
	stm32fxxx_rcc_apb2lpenr.tim1lpen = STM32FXXXRCC_APB2LPENR_tim1lpen;
	return &stm32fxxx_rcc_apb2lpenr;
}
STM32FXXXRCC_bdcr* stm32fxxx_rcc_bdcr_inic(void)
{

