BitNibble/Source_Library/stm32f411lib/Library/Src/stm32411rcc.c
	// BDCR
	stm32fxxx_rcc_bdcr.bdrst = STM32FXXXRCC_BDCR_bdrst;
	stm32fxxx_rcc_bdcr.rtcen = STM32FXXXRCC_BDCR_rtcen;
	stm32fxxx_rcc_bdcr.get_rtcen = STM32FXXXRCC_BDCR_get_rtcen;
	stm32fxxx_rcc_bdcr.rtcsel = STM32FXXXRCC_BDCR_rtcsel;
	stm32fxxx_rcc_bdcr.get_rtcsel = STM32FXXXRCC_BDCR_get_rtcsel;
	stm32fxxx_rcc_bdcr.lsemod = STM32FXXXRCC_BDCR_lsemod;
	stm32fxxx_rcc_bdcr.lsebyp = STM32FXXXRCC_BDCR_lsebyp;
	stm32fxxx_rcc_bdcr.get_lserdy = STM32FXXXRCC_BDCR_get_lserdy;
	stm32fxxx_rcc_bdcr.lseon = STM32FXXXRCC_BDCR_lseon;
	return &stm32fxxx_rcc_bdcr;
}
STM32FXXXRCC_csr* stm32fxxx_rcc_csr_inic(void)
{

	// CSR
	stm32fxxx_rcc_csr.get_lpwrrstf = STM32FXXXRCC_CSR_get_lpwrrstf;
	stm32fxxx_rcc_csr.get_wwdgrstf = STM32FXXXRCC_CSR_get_wwdgrstf;
	stm32fxxx_rcc_csr.get_iwdqrstf = STM32FXXXRCC_CSR_get_iwdqrstf;
	stm32fxxx_rcc_csr.get_sftrstf = STM32FXXXRCC_CSR_get_sftrstf;
	stm32fxxx_rcc_csr.get_porrstf = STM32FXXXRCC_CSR_get_porrstf;
	stm32fxxx_rcc_csr.get_pinrstf = STM32FXXXRCC_CSR_get_pinrstf;
	stm32fxxx_rcc_csr.get_borrstf = STM32FXXXRCC_CSR_get_borrstf;
	stm32fxxx_rcc_csr.clear_rmvf = STM32FXXXRCC_CSR_clear_rmvf;
	stm32fxxx_rcc_csr.get_lsirdy = STM32FXXXRCC_CSR_get_lsirdy;
	stm32fxxx_rcc_csr.lsion = STM32FXXXRCC_CSR_lsion;
	return &stm32fxxx_rcc_csr;
}
STM32FXXXRCC_sscgr* stm32fxxx_rcc_sscgr_inic(void)
{

	// SSCGR
	stm32fxxx_rcc_sscgr.sscgen = STM32FXXXRCC_SSCGR_sscgen;
	stm32fxxx_rcc_sscgr.spreadsel = STM32FXXXRCC_SSCGR_spreadsel;
	stm32fxxx_rcc_sscgr.incstep = STM32FXXXRCC_SSCGR_incstep;
	stm32fxxx_rcc_sscgr.modper = STM32FXXXRCC_SSCGR_modper;
	return &stm32fxxx_rcc_sscgr;
}
STM32FXXXRCC_plli2scfgr* stm32fxxx_rcc_plli2scfgr_inic(void)
{

	// PLLI2SCFGR
	stm32fxxx_rcc_plli2scfgr.plli2sr = STM32FXXXRCC_PLLI2SCFGR_plli2sr;
	stm32fxxx_rcc_plli2scfgr.plli2sq = STM32FXXXRCC_PLLI2SCFGR_plli2sq;
	stm32fxxx_rcc_plli2scfgr.plli2sp = STM32FXXXRCC_PLLI2SCFGR_plli2sp;
	stm32fxxx_rcc_plli2scfgr.plli2sn = STM32FXXXRCC_PLLI2SCFGR_plli2sn;
	stm32fxxx_rcc_plli2scfgr.plli2sm = STM32FXXXRCC_PLLI2SCFGR_plli2sm;
	return &stm32fxxx_rcc_plli2scfgr;
}
STM32FXXXRCC_dckcfgr* stm32fxxx_rcc_dckcfgr_inic(void)
{

	// DCKCFGR
	stm32fxxx_rcc_dckcfgr.i2s2src = STM32FXXXRCC_DCKCFGR_i2s2src;
	stm32fxxx_rcc_dckcfgr.i2s1src = STM32FXXXRCC_DCKCFGR_i2s1src;
	stm32fxxx_rcc_dckcfgr.timpre = STM32FXXXRCC_DCKCFGR_timpre;
	stm32fxxx_rcc_dckcfgr.sai2src = STM32FXXXRCC_DCKCFGR_sai2src;
	stm32fxxx_rcc_dckcfgr.sai1src = STM32FXXXRCC_DCKCFGR_sai1src;
	stm32fxxx_rcc_dckcfgr.pllsaidivq = STM32FXXXRCC_DCKCFGR_pllsaidivq;
	stm32fxxx_rcc_dckcfgr.plli2sdivq = STM32FXXXRCC_DCKCFGR_plli2sdivq;
	return &stm32fxxx_rcc_dckcfgr;
}
/*** Extended ***/
STM32FXXXRCCPLL* stm32fxxx_rcc_pll_inic(void)
{

	stm32fxxx_rcc_pll.division = STM32FXXXPLLDivision;
	stm32fxxx_rcc_pll.enable = STM32FXXXRccPLLCLKEnable;
	return &stm32fxxx_rcc_pll;
}
STM32FXXXRCCPLLI2S* stm32fxxx_rcc_plli2s_inic(void)
{

	stm32fxxx_rcc_plli2s.enable = STM32FXXXRccPLLI2SEnable;
	return &stm32fxxx_rcc_plli2s;
}
STM32FXXXRCCPLLSAI* stm32fxxx_rcc_pllsai_inic(void)
{

	stm32fxxx_rcc_pllsai.enable = STM32FXXXRccPLLSAIEnable;
	return &stm32fxxx_rcc_pllsai;
}
/*** INIC Procedure & Function Definition ***/
STM32FXXXRCCobj rcc_enable(void)
{


	/*** RCC Bit Mapping Link ***/
	stm32fxxx_rcc.cr = stm32fxxx_rcc_cr_inic();
	stm32fxxx_rcc.pllcfgr = stm32fxxx_rcc_pllcfgr_inic();
	stm32fxxx_rcc.cfgr = stm32fxxx_rcc_cfgr_inic();
	stm32fxxx_rcc.cir = stm32fxxx_rcc_cir_inic();
	stm32fxxx_rcc.ahb1rstr = stm32fxxx_rcc_ahb1rstr_inic();
	stm32fxxx_rcc.ahb2rstr = stm32fxxx_rcc_ahb2rstr_inic();
	stm32fxxx_rcc.apb1rstr = stm32fxxx_rcc_apb1rstr_inic();
	stm32fxxx_rcc.apb2rstr = stm32fxxx_rcc_apb2rstr_inic();
	stm32fxxx_rcc.ahb1enr = stm32fxxx_rcc_ahb1enr_inic();
	stm32fxxx_rcc.ahb2enr = stm32fxxx_rcc_ahb2enr_inic();
	stm32fxxx_rcc.apb1enr = stm32fxxx_rcc_apb1enr_inic();
	stm32fxxx_rcc.apb2enr = stm32fxxx_rcc_apb2enr_inic();
	stm32fxxx_rcc.ahb1lpenr = stm32fxxx_rcc_ahb1lpenr_inic();
	stm32fxxx_rcc.ahb2lpenr = stm32fxxx_rcc_ahb2lpenr_inic();
	stm32fxxx_rcc.apb1lpenr = stm32fxxx_rcc_apb1lpenr_inic();
	stm32fxxx_rcc.apb2lpenr = stm32fxxx_rcc_apb2lpenr_inic();
	stm32fxxx_rcc.bdcr = stm32fxxx_rcc_bdcr_inic();
	stm32fxxx_rcc.csr = stm32fxxx_rcc_csr_inic();
	stm32fxxx_rcc.sscgr = stm32fxxx_rcc_sscgr_inic();
	stm32fxxx_rcc.plli2scfgr = stm32fxxx_rcc_plli2scfgr_inic();
	stm32fxxx_rcc.dckcfgr = stm32fxxx_rcc_dckcfgr_inic();
	/*** PLL ***/
	stm32fxxx_rcc.pll = stm32fxxx_rcc_pll_inic();
	stm32fxxx_rcc.plli2s = stm32fxxx_rcc_plli2s_inic();
	stm32fxxx_rcc.pllsai = stm32fxxx_rcc_pllsai_inic();
	stm32fxxx_rcc.prescaler = STM32FXXXPrescaler;
	/*** Other ***/
	stm32fxxx_rcc.pll_division = STM32FXXXPLLDivision;
	stm32fxxx_rcc.pllclk_enable = STM32FXXXRccPLLCLKEnable;
	stm32fxxx_rcc.plli2s_enable = STM32FXXXRccPLLI2SEnable;
	stm32fxxx_rcc.pllsai_enable = STM32FXXXRccPLLSAIEnable;
	stm32fxxx_rcc.inic = rcc_start;
	stm32fxxx_rcc.henable = STM32FXXXRccHEnable;
	stm32fxxx_rcc.hselect = STM32FXXXRccHSelect;
	stm32fxxx_rcc.lenable = STM32FXXXRccLEnable;
	stm32fxxx_rcc.lselect = STM32FXXXRccLSelect;
	/*** Nvic ***/
	stm32fxxx_rcc.nvic = STM32FXXXRCC_nvic;
	return stm32fxxx_rcc;
}

STM32FXXXRCCobj* rcc(void){ return &stm32fxxx_rcc; };

/*** EOF ***/

/******
1º Sequence
2º Scope
	- Library Scope
	- File Scope
	- Function Scope
	- Precedence Scope
3º Pointer and Variable
4º Casting
******/

